<?php

$portals = [
  'Хорватія' => [
    'depth' => 2,
  ],
  'Україна' => [
  	'ignore' => [
  		'Російська імперія',
  		'Річ Посполита',
  		'I Річ Посполита',
  		'Конфедерації Речі Посполитої',
  		'Смутний час',
  		'Адміністративно-територіальний поділ Великого князівства Литовського',
  		'Угорське королівство',
  		'Освіта в Російській імперії',
  		'Російська мова',
  		'Ідиш',
  		'Німецька мова',
  	],
  ],
  'Білорусь' => [
  	'ignore' => [
  		'Велике князівство Литовське',
  		'Русь',
  		'Київська Русь',
  		'Річ Посполита',
  		'I Річ Посполита',
  		'Житомирська область',
  		'Ідиш',
  		'Цигани',
  		'Росіяни',
  		'Литовці',
  		'Поляки',
  	],
  ],
  'Освіта' => [
    'depth' => 4,
    'ignore' => [
    	'Python',
    ],
  ],
  'Католицтво' => [
    'categories' => ['Католицизм'],
    'depth' => 6,
    'ignore' => [
    	'Канонізація',
    	'Лицарські ордени',
    ],
  ],
  'Культура' => [
  	'ignore' => [
  		'Регіони традиційного поширення українців і української мови',
  		'Міграція',
  		'Імена',
  		'Ігри',
  		'Література',
  		'Бароко',
  	]
  ],
  'Право' => [
  	'ignore' => [
  		'Торгові марки',
  		'Титули',
  		'Національність',
  	]
  ],
  'Філософія' => [
  	'ignore' => [
  		'Політологія',
	],
  ],
  'Медицина' => [],
  'Географія' => [
    'depth' => 4,
    'ignore' => [
    	'Категорії за країною',
    	'Історія за містом',
    	'Культура за містом',
    	'Країни, що не мають виходу до моря',
		'Яхтсмени',
	]
  ],
  'Музика' => [
    'depth' => 5,
  ],
  'Швеція' => [],
  'Молдова' => [],
  'Польща' => [],
  'Росія' => [],
  'Румунія' => [],
  'Словаччина' => [],
  'Угорщина' => [],
  'Туреччина' => [],
  'Історія' => [
    'depth' => 2,
  ],
  'Спорт' => [],
  'Залізниця' => [
    'categories' => ['Залізничний транспорт'],
    'depth' => 6,
  ],
  'Африка' => [],
  'Європа' => [],
  'Азія' => [],
  'Хімія' => [],
  'Фізика' => [],
  'Математика' => [],
  'Біологія' => [],
  'Психологія' => [],
  'Українська діаспора' => [
    'depth' => 2,
  ],
  'Українська мова' => [
    'depth' => 1,
  ], 
];